app/views/home/_dishes.html.erb

            <span>
              <%= d.ratings.average(:rating).present? ? d.ratings.average(:rating).round(1) : 0 %>
            </span>
            <p class="votes"><%= d.ratings.count(:rating) %> votes</p>
---
SELECT AVG(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 147
SELECT COUNT(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 147

              <h2><%= d.name %></h2>
               <% d.restaurants.each do |r|%>
---
SELECT `restaurants`.* FROM `restaurants` INNER JOIN `dishes_restaurants` ON `restaurants`.`id` = `dishes_restaurants`.`restaurant_id` WHERE `dishes_restaurants`.`dish_id` = 147