app/views/dishes/show.html.erb

      <p class="restra-txt" style = "border-bottom: 2px solid #d8d8d8;">
        <% @dish.restaurants.each do |r| %>
---
SELECT `restaurants`.* FROM `restaurants` INNER JOIN `dishes_restaurants` ON `restaurants`.`id` = `dishes_restaurants`.`restaurant_id` WHERE `dishes_restaurants`.`dish_id` = 137

        <div class="rating">
            <% pre_like = @dish.likes.find { |like| like.user_id == current_user.id} %>
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`dish_id` = 137

              <% end %>
            <p class="votes" ><%= @dish.likes.count %> <%= (@dish.likes.count) == 1 ? 'Like' : 'Likes'%></p>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`dish_id` = 137

      <!-- Prev and next icons in dish image -->
        <% unless  @dish.id == Dish.first.id   %>
---
SELECT  `dishes`.* FROM `dishes` ORDER BY `dishes`.`id` ASC LIMIT 1


        <% unless  @dish.id == Dish.last.id   %>
---
SELECT  `dishes`.* FROM `dishes` ORDER BY `dishes`.`id` DESC LIMIT 1

      <h4>Overall Rating &nbsp;
        <%= @dish.ratings.average(:rating).present? ? @dish.ratings.average(:rating).round(1) : 0 %>
        <i class="review-rating" data-score = " <%= @dish.ratings.average(:rating).present? ? @dish.ratings.average(:rating).round(1) : 0 %>"></i>

      </h4><br><i >Based on <%= @dish.ratings.count(:rating) %> Reviews</i><br>
---
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`dish_id` = 137
SELECT AVG(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 137
SELECT COUNT(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 137

         &nbsp;
         <span>(<%= @dish.ratings.where(rating: 5).count %>)</span>
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 137 AND `ratings`.`rating` = 5

         &nbsp;
         <span>(<%= @dish.ratings.where(rating: 4).count %>)</span>
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 137 AND `ratings`.`rating` = 4

         &nbsp;
         <span>(<%= @dish.ratings.where(rating: 3).count %>)</span>
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 137 AND `ratings`.`rating` = 3

         &nbsp;
         <span>(<%= @dish.ratings.where(rating: 2).count %>)</span>
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 137 AND `ratings`.`rating` = 2

         &nbsp;
         <span>(<%= @dish.ratings.where(rating: 1).count %>)</span>
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 137 AND `ratings`.`rating` = 1

      <div class="review_left" >
        <% @dish.ratings.each do |rate| %>
---
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`dish_id` = 137