app/controllers/dishes_controller.rb

  def show

    @dish = Dish.find(params[:id])
---
SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 137 LIMIT 1