app/controllers/home_controller.rb

  def index
    if  params[:location]
      @locations = Location.where("city LIKE ?", "%#{params[:location]}%")
      restaurants = []
      location_dishes = []
        @locations.each do |l|
          l.restaurants.each do |r|
            restaurants.push(r)
              r.dishes.each do |d|
                location_dishes.push(d)
              end
          end
        end
      @dishes = location_dishes.paginate(:page => params[:page], :city => params[:location], :per_page => 50)

    else
      @dishes = Dish.by_rating.paginate(:page => params[:page], :per_page => 6)
---
SELECT COUNT(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 147